#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "Dev-VPC-default"
        }
      + tags_all               = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-default"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "Dev-VPC-default"
        }
      + tags_all               = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-default"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Dev-VPC-default"
        }
      + tags_all               = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-default"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Dev-VPC"
        }
      + tags_all = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Dev-VPC-private-eu-central-1a"
        }
      + tags_all         = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-private-eu-central-1a"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Dev-VPC-private-eu-central-1b"
        }
      + tags_all         = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-private-eu-central-1b"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Dev-VPC-private-eu-central-1c"
        }
      + tags_all         = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-private-eu-central-1c"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Dev-VPC-public"
        }
      + tags_all         = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-public"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Dev-VPC-private-eu-central-1a"
        }
      + tags_all                                       = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-private-eu-central-1a"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Dev-VPC-private-eu-central-1b"
        }
      + tags_all                                       = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-private-eu-central-1b"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Dev-VPC-private-eu-central-1c"
        }
      + tags_all                                       = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-private-eu-central-1c"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Dev-VPC-public-eu-central-1a"
        }
      + tags_all                                       = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-public-eu-central-1a"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Dev-VPC-public-eu-central-1b"
        }
      + tags_all                                       = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-public-eu-central-1b"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Dev-VPC-public-eu-central-1c"
        }
      + tags_all                                       = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC-public-eu-central-1c"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "Dev-VPC"
        }
      + tags_all                             = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "Name"            = "Dev-VPC"
          + "OwnerEmail"      = "artembrigaz@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
          + "Type"            = "Networking"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr_block  = "10.10.0.0/16"
  + vpc_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @reflection21, Action: `pull_request`, Working Directory: `aws/networking/vpc`, Workflow: `Terraform CI/CD`*